src/InformationRegisters/дсфСоответствиеВидовОбъектовХраненияТипамТоваровЯМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфСоответствиеВидовОбъектовХраненияТипамТоваровЯМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбъектовХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЕдиницыТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфСтатусыЕдиницТовараЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСтока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфТипыСтоковЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СостояниеОбъектовХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияОбъектовХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/дсфТипыСтоковЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>дсфТипыСтоковЯндексМаркет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОпределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаютсяНаСкладМаркетаСлужебный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Годные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступныДляЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайденыНаСкладеПриИнвентаризацииИлиПеремещаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/дсфТипыПриемкиЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>дсфТипыПриемкиЯндексМаркет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладМаркетаFBY</Name>
					<Comment>Товары принимаются на склад Маркета при работе по модели FBY (продажи с фулфилментом Яндекса)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСкладМаркетаFBYPlus</Name>
					<Comment>Товары принимаются на склад Маркета при работе по модели FBY+ (поставка под заказ).</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/дсфТипыОтправкиЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>дсфТипыОтправкиЯндексМаркет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПартнерскогоСклада</Name>
					<Comment>Товары отправляются с партнерского склада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписываютсяПриИнвентаризации</Name>
					<Comment>Товары списываются при инвентаризации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНеСвязанноеСЗаказами</Name>
					<Comment>Товары отправляются с одного склада Маркета на другой (перемещение товаров, не связанное с заказом на Маркете).</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбычноеИзъятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/дсфТипыРеестровЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>дсфТипыРеестровЯндексМаркет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПлановыйРеестрМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическийРеестрПартнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/дсфОбщегоНазначенияЯндексМаркет/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Проверяет наличие свойства у объекта XDTO. Возвращает Истина, если свойство присутствует.
//
// Параметры:
//  ОбъектXDTO	 - 	 - 
//  ИмяСвойства	 - 	 - 
// 
// Возвращаемое значение:
//   - Булево: Истина - свойство присутствует
//
Функция ЕстьСвойствоОбъектаXDTO(ОбъектXDTO, ИмяСвойства) Экспорт

	Возврат дсфОбщегоНазначения.ЕстьСвойствоОбъектаXDTO(ОбъектXDTO, ИмяСвойства);

КонецФункции

// Возвращает значение свойства объекта XDTO.
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO, из которого необходимо прочитать значение ключа.
//   ИмяСвойства - Строка - имя свойства объекта XDTO, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в объекте нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства xdto. ЗначениеПоУмолчанию если в xdto нет указанного свойства.
//
Функция ЗначениеСвойстваXdto(ОбъектXDTO, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат дсфОбщегоНазначения.ЗначениеСвойстваXdto(ОбъектXDTO, ИмяСвойства, ЗначениеПоУмолчанию);
	
КонецФункции

Функция XMLСтрокаБезПространствИмен(Знач XMLСтрока) Экспорт
	
	Результат = XMLСтрока;
	
	Результат = СтрЗаменить(Результат, " xmlns=""http://www.dsf-yandex-market.kz""", "");
	Результат = СтрЗаменить(Результат, " xmlns:xs=""http://www.w3.org/2001/XMLSchema""", "");
	Результат = СтрЗаменить(Результат, " xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""", "");
	Результат = СтрЗаменить(Результат, " xmlns=""""", "");
	
	Возврат Результат;
	
КонецФункции

Функция XMLСтрокаСПространствомИменВУзлеRoot(Знач XMLСтрока) Экспорт
	
	Результат = XMLСтрока;
	
	Результат = СтрЗаменить(Результат,
							"<root>",
							"<root xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xmlns:xsd=""http://www.w3.org/2001/XMLSchema"">");
	
	Возврат Результат;
	
КонецФункции

Функция ИнтервалДатИзСтроки(ИнтервалСтрокой, РазделительДат = "/", УчитыватьГраницуОкончания = Ложь) Экспорт
	Возврат дсфОбщегоНазначения.ИнтервалДатИзСтроки(ИнтервалСтрокой, РазделительДат, УчитыватьГраницуОкончания);
	
КонецФункции

Функция ДатаИзСтроки(ДатаСтрокой) Экспорт
	
	Возврат дсфОбщегоНазначения.ДатаИзСтроки(ДатаСтрокой);
	
КонецФункции

// Возвращает таблицу значений на основании массива структур
//
// Параметры:
// МассивСтруктур - Массив Из Структура - Массив структур, которые будут преобразованы в таблиц значений.
//    Свойства структуры первого элемента массива определяют состав колонок результирующей таблицы.
//
// Возвращаемое значение:
// ТаблицаЗначений - таблица значений, созданная из массива структур.
//
Функция ПреобразоватьМассивВТаблицуЗначений(МассивСтруктур) Экспорт
	
	Возврат дсфОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(МассивСтруктур)

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбъемПоГабаритам(Ширина = 0, Длина = 0, Высота = 0, КоэффициентПересчетаОбъема) Экспорт
	
	Возврат СлужебныйКлиентСервер.ОбъемПоРазмерам(Ширина, Длина, Высота, КоэффициентПересчетаОбъема);
	
КонецФункции

Функция ЕдиницаИзмеренияШтук() Экспорт

	Возврат дсфОбщегоНазначения.ЕдиницаИзмеренияШтук();
	
КонецФункции

Функция ПолучитьПеречислениеПоИмени(Знач ТипПеречисления, Знач ИмяПеречисления) Экспорт
	
	Возврат дсфОбщегоНазначения.ПолучитьПеречислениеПоИмени(ТипПеречисления, ИмяПеречисления);
	
КонецФункции

Функция ПроцессПоступленияПоУмолчанию() Экспорт
	
	Возврат дсфОбщегоНазначения.ПроцессПоступленияПоУмолчанию();
	
КонецФункции

Функция ПроцессОтгрузкиПоУмолчанию() Экспорт
	
	Возврат дсфОбщегоНазначения.ПроцессПоступленияПоУмолчанию();
	
КонецФункции

Функция ПоклажедательПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Поклажедатель = Константы.дсфОсновнойПоклажедательЯндексМаркет.Получить();
	
	Возврат Поклажедатель;
	
КонецФункции

Функция ИдентификаторСклада() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторСклада = Константы.дсфИдентификаторСкладаЯндексМаркет.Получить();
	
	Возврат ИдентификаторСклада;
	
КонецФункции

Функция ИдентификаторПоставщика() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПоставщика = Константы.дсфОсновнойИдентификаторПоставщикаЯндексМаркет.Получить();
	
	Возврат ИдентификаторПоставщика;
	
КонецФункции

Функция ТипМестаХраненияДляПалетПоУмолчанию() Экспорт
	
	Возврат дсфОбщегоНазначения.ТипМестаХраненияДляПалетПоУмолчанию();
	
КонецФункции

Функция ТипМестаХраненияДляКоробовПоУмолчанию() Экспорт
	
	Возврат дсфОбщегоНазначения.ТипМестаХраненияДляКоробовПоУмолчанию();
		
КонецФункции

Функция ВидОбъектаХраненияПоТипуТовара(ТипТовара) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	дсфСоответствиеВидовОбъектовХраненияТипамТоваровЯМаркет.ВидОбъектаХранения КАК ВидОбъектаХранения
	               |ИЗ
	               |	РегистрСведений.дсфСоответствиеВидовОбъектовХраненияТипамТоваровЯМаркет КАК дсфСоответствиеВидовОбъектовХраненияТипамТоваровЯМаркет
	               |ГДЕ
	               |	дсфСоответствиеВидовОбъектовХраненияТипамТоваровЯМаркет.ТипТовара = &ТипТовара";
	
	Запрос.УстановитьПараметр("ТипТовара", ТипТовара);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ВидОбъектаХранения;	

	КонецЦикла;
		
	Возврат Справочники.ВидыОбъектовХранения.ПустаяСсылка();
	
КонецФункции

Функция СостояниеОбъектаХраненияПоСтатусуЕдиницыТовара(СтатусЕдиницыТовара) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СостояниеОбъектовХранения КАК СостояниеОбъектовХранения
	               |ИЗ
	               |	РегистрСведений.дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет КАК дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет
	               |ГДЕ
	               |	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СтатусЕдиницыТовара = &СтатусЕдиницыТовара";
	
	Запрос.УстановитьПараметр("СтатусЕдиницыТовара", СтатусЕдиницыТовара);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СостояниеОбъектовХранения;
		
	КонецЦикла;
		
	Возврат Справочники.СостоянияОбъектовХранения.ПустаяСсылка();

КонецФункции

Функция ТипСтокаЯндексМаркетДляСостоянияОбъектаХранения(СостояниеОбъектаХранения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.ТипСтока КАК ТипСтока
	               |ИЗ
	               |	РегистрСведений.дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет КАК дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет
	               |ГДЕ
	               |	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СостояниеОбъектовХранения = &СостояниеОбъектовХранения";
	
	Запрос.УстановитьПараметр("СостояниеОбъектовХранения", СостояниеОбъектаХранения);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ТипСтока;
		
	КонецЦикла;
		
	Возврат Перечисления.дсфТипыСтоковЯндексМаркет.НеОпределен;

КонецФункции

// Функция - Код типа стока яндекс маркет служебный
//
// Параметры:
//  ТипСтока - Перечисление.dsf_ТипыСтоковЯндексМаркет	 - 
// 
// Возвращаемое значение:
//   - число
//
Функция КодТипаСтокаЯндексМаркетСлужебный(ТипСтока) Экспорт
	Если ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.НеОпределен Тогда
		Возврат -1;
		
	ИначеЕсли ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.ПринимаютсяНаСкладМаркетаСлужебный Тогда
		Возврат 0;
		
	ИначеЕсли ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.Годные Тогда
		Возврат 10;
	
	ИначеЕсли ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.ДоступныДляЗаказа Тогда
		Возврат 20;
		
	ИначеЕсли ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.Просрочены Тогда
		Возврат 30;

	ИначеЕсли ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.НеНайденыНаСкладеПриИнвентаризацииИлиПеремещаются Тогда
		Возврат 40;
		
	ИначеЕсли ТипСтока = Перечисления.дсфТипыСтоковЯндексМаркет.Брак Тогда
		Возврат 50;
	
	КонецЕсли;
	
	Возврат -1;
	
КонецФункции

Функция КодТипСтокаЯндексМаркетДляСостоянияОбъектаХранения(СостояниеОбъектаХранения) Экспорт
	
	ТипСтока = ТипСтокаЯндексМаркетДляСостоянияОбъектаХранения(СостояниеОбъектаХранения);

	Возврат КодТипаСтокаЯндексМаркетСлужебный(ТипСтока);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ТипПриемкиПоЧисловомуКоду(КодТипаПриемки) Экспорт

	Если КодТипаПриемки = 0 Тогда
		Возврат Перечисления.дсфТипыПриемкиЯндексМаркет.НаСкладМаркетаFBY;
		
	ИначеЕсли КодТипаПриемки = 1 Тогда
		Возврат Перечисления.дсфТипыПриемкиЯндексМаркет.НаСкладМаркетаFBYPlus;
	
	Иначе
		Возврат Перечисления.дсфТипыПриемкиЯндексМаркет.ПустаяСсылка();
		
	КонецЕсли;

КонецФункции

Функция КодТипаПриемкиПоЗначениюПеречисления(ТипПриемки) Экспорт
	
	Если ТипПриемки = Перечисления.дсфТипыПриемкиЯндексМаркет.НаСкладМаркетаFBY Тогда
		Возврат 0;
	
	ИначеЕсли ТипПриемки = Перечисления.дсфТипыПриемкиЯндексМаркет.НаСкладМаркетаFBYPlus Тогда
		Возврат 1;

	Иначе
		Возврат 0;
	
	КонецЕсли;

КонецФункции

Функция ТипОтправкиПоЧисловомуКоду(КодТипаОтправки) Экспорт

	Если КодТипаОтправки = 0 Тогда
		Возврат Перечисления.дсфТипыОтправкиЯндексМаркет.СПартнерскогоСклада;
		
	ИначеЕсли КодТипаОтправки = 1 Тогда
		Возврат Перечисления.дсфТипыОтправкиЯндексМаркет.СписываютсяПриИнвентаризации;

	ИначеЕсли КодТипаОтправки = 3 Тогда
		Возврат Перечисления.дсфТипыОтправкиЯндексМаркет.ПеремещениеНеСвязанноеСЗаказами;
	
	ИначеЕсли КодТипаОтправки = 11 Тогда
		Возврат Перечисления.дсфТипыОтправкиЯндексМаркет.ОбычноеИзъятие;
	
	ИначеЕсли КодТипаОтправки = 28 Тогда
		Возврат Перечисления.дсфТипыОтправкиЯндексМаркет.Отгрузка;
		
	Иначе
		Возврат Перечисления.дсфТипыОтправкиЯндексМаркет.ПустаяСсылка();
		
	КонецЕсли;

КонецФункции

Функция КодТипаОтправкиПоЗначениюПеречисления(ТипОправки) Экспорт
	
	Если ТипОправки = Перечисления.дсфТипыОтправкиЯндексМаркет.СПартнерскогоСклада Тогда
		Возврат 0;
		
	ИначеЕсли ТипОправки = Перечисления.дсфТипыОтправкиЯндексМаркет.СписываютсяПриИнвентаризации Тогда
		Возврат 1;
		
	ИначеЕсли ТипОправки = Перечисления.дсфТипыОтправкиЯндексМаркет.ПеремещениеНеСвязанноеСЗаказами Тогда
		Возврат 3;
		
	ИначеЕсли ТипОправки = Перечисления.дсфТипыОтправкиЯндексМаркет.ОбычноеИзъятие Тогда
		Возврат 11;
	
	ИначеЕсли ТипОправки = Перечисления.дсфТипыОтправкиЯндексМаркет.Отгрузка Тогда
		Возврат 28;
	
	Иначе
		Возврат 0;
	
	КонецЕсли;

КонецФункции

Функция ТипРеестраПоЧисловомуКоду(КодТипаРеестра) Экспорт

	Если КодТипаРеестра = 0 Тогда
		Возврат Перечисления.дсфТипыРеестровЯндексМаркет.ПлановыйРеестрМаркет;
		
	ИначеЕсли КодТипаРеестра = 1 Тогда
		Возврат Перечисления.дсфТипыРеестровЯндексМаркет.ФактическийРеестрПартнер;
	
	Иначе
		Возврат Перечисления.дсфТипыРеестровЯндексМаркет.ПустаяСсылка();
		
	КонецЕсли;

КонецФункции

Функция КодТипаРеестраПоЗначениюПеречисления(ТипРеестра) Экспорт
	
	Если ТипРеестра = Перечисления.дсфТипыРеестровЯндексМаркет.ПлановыйРеестрМаркет Тогда
		Возврат 0;
		
	ИначеЕсли ТипРеестра = Перечисления.дсфТипыРеестровЯндексМаркет.ФактическийРеестрПартнер Тогда
		Возврат 1;
	
	Иначе
		Возврат 0;
		
	КонецЕсли;

КонецФункции

Функция ТипИдентификатораПоНазванию(ТипИдентификатораСтрокой) Экспорт
	Возврат ПолучитьПеречислениеПоИмени("дсфТипыИдентификаторовЯндексМаркет", ТипИдентификатораСтрокой);	
	
КонецФункции

Функция СтатусЕдиницыТовараПоНазванию(СтатусЕдиницыТовараСтрокой) Экспорт
	Возврат ПолучитьПеречислениеПоИмени("дсфСтатусыЕдиницТовараЯндексМаркет", СтатусЕдиницыТовараСтрокой);	
	
КонецФункции

// Возвращает описание типов по переданному типу
//
// Параметры:
//    Тип - Тип - Тип значения
//
// Возвращаемое значение:
//    ОписаниеТипов - созданное на основании переданного типа описание типов.
//
Функция ОписаниеТиповПоТипу(Тип) Экспорт
	Возврат дсфОбщегоНазначения.ОписаниеТиповПоТипу(Тип);

КонецФункции

#КонецОбласти
